---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointIterator.IsDone
source: html/60b6fbed-83f5-9f2c-fae5-d0f56a029079.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.IsDone Method

Identifies if the iteration has reached the end of the collection.

## Syntax (C#)
```csharp
public bool IsDone()
```

## Returns
True if the iteration has reached the end, false otherwise.